In [12]:
import pandas as pd

In [11]:
fb=["Facebook",2449,True,2006]
tt=["Twitter",339,False,2006]
ig=["Instagram",1000,True,2010]
yt=["YouTube",2000,False,2005]
lkn=["LinkeIn",663,False,2003]
ws=["WhatsApp",1600,True,2009]

In [13]:
lista_rrss=[fb,tt,ig,yt,lkn,ws]

In [14]:
df_rrss=pd.DataFrame(lista_rrss, columns = ["Nombre", "Cantidad","ES_FB", "Año"])
df_rrss

      Nombre  Cantidad  ES_FB   Año
0   Facebook      2449   True  2006
1    Twitter       339  False  2006
2  Instagram      1000   True  2010
3    YouTube      2000  False  2005
4    LinkeIn       663  False  2003
5   WhatsApp      1600   True  2009

In [15]:
df_vacio=pd.DataFrame(columns=["Nombre", "Cantidad","ES_FB", "Año"])

df_vacio

Empty DataFrame
Columns: [Nombre, Cantidad, ES_FB, Año]
Index: []

In [16]:
df_vacio=df_vacio.append({"Nombre ": "Facebook", "Cantidad" : 2449, "ES_FB" : True, "Año" : 2006}, ignore_index=True)
df_vacio

/var/folders/cv/d__dx_557kg_0k75cfkhppcr0000gn/T/ipykernel_53170/1781239264.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_vacio=df_vacio.append({"Nombre ": "Facebook", "Cantidad" : 2449, "ES_FB" : True, "Año" : 2006}, ignore_index=True)

  Nombre Cantidad ES_FB   Año   Nombre
0    NaN     2449  True  2006  Facebook

In [17]:
df_rrss

      Nombre  Cantidad  ES_FB   Año
0   Facebook      2449   True  2006
1    Twitter       339  False  2006
2  Instagram      1000   True  2010
3    YouTube      2000  False  2005
4    LinkeIn       663  False  2003
5   WhatsApp      1600   True  2009

In [18]:
df_rrss.loc[1, "Nombre"]

'Twitter'

In [19]:
df_rrss.iloc[1,0]

'Twitter'

In [20]:
df_rrss["Nombre"]

0     Facebook
1      Twitter
2    Instagram
3      YouTube
4      LinkeIn
5     WhatsApp
Name: Nombre, dtype: object

In [21]:
df_rrss.iloc[4]

Nombre      LinkeIn
Cantidad        663
ES_FB         False
Año            2003
Name: 4, dtype: object

In [22]:
df_rrss["Cantidad"]>1500

0     True
1    False
2    False
3     True
4    False
5     True
Name: Cantidad, dtype: bool

In [23]:
df_rrss[df_rrss["Cantidad"]>1500]

     Nombre  Cantidad  ES_FB   Año
0  Facebook      2449   True  2006
3   YouTube      2000  False  2005
5  WhatsApp      1600   True  2009

In [24]:

df_rrss.sort_values("Nombre", ascending=True)

      Nombre  Cantidad  ES_FB   Año
0   Facebook      2449   True  2006
2  Instagram      1000   True  2010
4    LinkeIn       663  False  2003
1    Twitter       339  False  2006
5   WhatsApp      1600   True  2009
3    YouTube      2000  False  2005

In [25]:

df_rrss.sort_values("Cantidad", ascending=False)

      Nombre  Cantidad  ES_FB   Año
0   Facebook      2449   True  2006
3    YouTube      2000  False  2005
5   WhatsApp      1600   True  2009
2  Instagram      1000   True  2010
4    LinkeIn       663  False  2003
1    Twitter       339  False  2006

In [27]:
df_rrss.sort_values(["Año", "Cantidad"], ascending=[True,False])

      Nombre  Cantidad  ES_FB   Año
4    LinkeIn       663  False  2003
3    YouTube      2000  False  2005
0   Facebook      2449   True  2006
1    Twitter       339  False  2006
5   WhatsApp      1600   True  2009
2  Instagram      1000   True  2010